Revit 2024 API
BuiltInFailures.DPartFailures.DivisionContainsNoReferences Property
 The division contains no dividing references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DivisionContainsNoReferences { get; }
Visual Basic
Public Shared ReadOnly Property DivisionContainsNoReferences As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DivisionContainsNoReferences {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace